const Simpsons = () => {
    const simpsons = [
        {
            name: 'Bart',
            surname: 'Simpson',
            age: 10,
            info: 'Бартолом\'ю ДжоДжо «Барт» Сімпсон (англ. Bartholomew JoJo «Bart» Simpson) — один із головних героїв мультиплікаційного серіалу Сімпсони. Барт — найстарша дитина Гомера і Мардж Сімпсон. У нього також є дві молодші сестри — Ліса і Меґґі. Барт є втіленням образу бешкетника та посереднього учня у школі. Разом зі своїм батьком Барт є одним із найвідоміших персонажів у цьому серіалі.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/a/aa/Bart_simpson.png'
        },
        {
            name: 'Homer',
            surname: 'Simpson',
            age: 40,
            info: 'Гомер Джей Сімпсон (англ. Homer Jay Simpson) — один із головних героїв мультсеріалу «Сімпсони». Гомер — грубий і неввічливий батько родини, він має очевидні вади: товстий, лисий і не дуже розумний. Нерідко він поводиться як блазень, абсурдно, егоїстично і нетактовно, але все ж лишається симпатичним.',
            photo: 'http://upload.wikimedia.org/wikipedia/en/0/02/Homer_Simpson_2006.png'
        },
        {
            name: 'Marge',
            surname: 'Simpson',
            age: 38,
            info: 'Ма́рджори Жакли́н «Мардж» Си́мпсон (в девичестве Бувье́) (англ. Marjorie Jacqueline «Marge» Simpson) — постоянный персонаж мультипликационного сериала «Симпсоны», её озвучивает Джулия Кавнер. Обычно носит зелёное платье, красные балетки, на шее — ожерелье из искусственного жемчуга и ездит на оранжевом универсале. У неё шикарные синие волосы, которые она обычно собирает в очень высокую причёску. Глаза цвета ореха (19s6e). Основное занятие — домохозяйка, большую часть времени проводит в заботе о доме, детях и Гомере. Образ Мардж копирует стереотип провинциальной американской домохозяйки 50-х годов. Мардж — единственный член семьи, посещающий церковь добровольно. Старается поддерживать нравственность не только своей семьи, но и всего города. Отлично готовит, особенно славятся её свиные отбивные и зефир. Любимое блюдо — лапша с маслом.',
            photo: 'https://upload.wikimedia.org/wikipedia/ru/0/0b/Marge_Simpson.png'
        },
        {
            name: 'Lisa',
            surname: 'Simpson',
            age: 9,
            info: 'Ли́за Мари́ Си́мпсон (англ. Lisa Marie Simpson) — героиня мультипликационного сериала «Симпсоны». Средний ребёнок в семье, восьмилетняя девочка, выделяющаяся среди остальных Симпсонов прежде всего своим умом и рассудительностью.',
            photo: 'https://upload.wikimedia.org/wikipedia/ru/e/ec/Lisa_Simpson.png'
        },
        {
            name: 'Maggie',
            surname: 'Simpson',
            age: 1,
            info: 'Ма́ргарет Эвелин «Мэ́гги» Си́мпсон (англ. Margaret Evelyn “Maggie” Simpson) — персонаж мультсериала «Симпсоны». Впервые появилась на телевидении в шоу Трейси Ульман, в короткометражке Good Night (англ.)русск. 19 апреля 1987 года. Мэгги была придумана и разработана карикатуристом Мэттом Грейнингом, пока он ждал встречи с Джеймсом Л. Бруксом. Названа в честь младшей сестры Грейнинга. После появления в шоу Трейси Ульман, через три года семья Симпсонов получила собственный сериал на телеканале Fox, дебют произошёл 17 декабря 1989 года.',
            photo: 'https://upload.wikimedia.org/wikipedia/ru/9/9d/Maggie_Simpson.png'
        },
        {
            name: 'Barney',
            surname: 'Gumble',
            age: 38,
            info: 'Barnard «Barney» Gumble; нар. 20 квітня)[3] — персонаж мультсеріалу Сімпсони, який, за власним визнанням, є невиліковним алкоголіком. Барні є однолітком та колишнім шкільним другом Гомера Сімпсона. Чоловікам по 38 років, але Гамбл є старшим за Гомера, який народився у травні. Через свій алкоголізм Барні поки неодружений; у нього немає подруг. Незважаючи на це, чоловік завжди вірний своїм друзям. Барні неодноразово рятував Гомера з сім\'єю з різних небезпечних пригод.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/2/25/Barney_110.gif'
        },
        {
            name: 'Маленький Помічник Санти',
            surname: 'dog',
            age: 3,
            info: 'Пес з\'являється в родині Сімпсонів в першій серії мультсеріалу. Історія його появи така: Гомер не отримав різдвяної премії, тому не має за що купити подарунки родині. Аби заробити хоч щось, він влаштовується працювати Санта-Клаусом. В результаті отримує лише 13 доларів. Його друг Барі радить поставити ці гроші на пса, який бере участь у собачих бігах і вважається фаворитом. Та Гомер не слухається і ставить все на іншу собаку — Помічника Санти, бо йому подобається прізвисько пса. Але той прибігає на фініш останнім. Розлючений власник викидає пса на вулицю. Гомер вирішує забрати його додому. Це стає найкращим подарунком для родини на Різдво.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/8/81/%D0%9C%D0%9F%D0%A1.gif'
        },
        {
            name: 'Marion Anthony',
            surname: 'D\'Amico',
            age: 46,
            info: 'Жирний Тоні контролює цілу гілку свого кримінального угрупування, у якому понад 200 бандитів, проте у серіалі фігурують тільки декілька наближених до Тоні осіб: Ноги, Луї, Джоні, Джой, Джої (що у перекладі означає «дитинча кенгуру») та «стукач» Френкі.\n' +
                '\n' + 'Жирний Тоні помер від серцевого нападу у 9-й серії 22-го сезону («Donnie Fatso») і був замінений своїм кузеном Струнким Тоні. Згодом той розжирів і його так само стали називати Жирний Тоні.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/6/68/The_Simpsons-Fat_Tony-1-.png'
        },
        {
            name: 'Robert Underdunk',
            surname: 'Terwilliger',
            age: 45,
            info: 'Спочатку грав у серіалі невелику роль — був актором другого плану у шоу клоуна Красті, надалі перетворився на лиходія, одержимого ідеєю вбивства Барта Сімпсона, хоча насправді він не може вбити хлопчика. Примітні особливості Боба: неслухняне яскраве волосся, ступні величезного розміру і приголомшливий голос',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/6/68/The_Simpsons-Fat_Tony-1-.png'
        }


    ];

    return (
        <div>
            {simpsons.map(value, index)=><Simpson key={index} simpson={value}/>}
        </div>
    );
};

export {Simpsons};