import {Simpson} from "./Simpson";
const Simpsons = () => {
    const simpsons = [
        {
            name: 'Homer',
            surname: 'Simpson',
            age: 40,
            info: 'Гомер Джей Сімпсон (англ. Homer Jay Simpson) — один із головних героїв мультсеріалу «Сімпсони». Гомер — грубий і неввічливий батько родини, він має очевидні вади: товстий, лисий і не дуже розумний. Нерідко він поводиться як блазень, абсурдно, егоїстично і нетактовно, але все ж лишається симпатичним.',
            photo: 'http://upload.wikimedia.org/wikipedia/en/0/02/Homer_Simpson_2006.png'
        },
        {
            name: 'Marge',
            surname: 'Simpson',
            age: 38,
            info: 'Мардж — матріарх родини Сімпсонів. З чоловіком Гомером вона має трьох дітей: Барта , Лізу та Меггі . Мардж є моралізатором у своїй сім’ї, і вона часто дає приземливий голос у розпал сімейних витівок, намагаючись підтримувати порядок у родині Сімпсонів. Її часто зображують як стереотипну телевізійну матір, і її часто включають до списків найкращих «телевізійних мам». Вона з’являлася в інших медіа, пов’язаних із «Сімпсонами» , зокрема у відеоіграх , фільмі «Сімпсони» , « Поїздка Сімпсонів» , рекламі та коміксах , і надихнула на створення цілої лінії товарів.\n' +
                '\n' +
                'Характерна зачіска Мардж «блакитний вулик» була натхненна поєднанням «Нареченої» у « Нареченій Франкенштейна» та стилю, який носила Маргарет Гронінг у 1960-х роках.',
            photo: 'https://upload.wikimedia.org/wikipedia/ru/0/0b/Marge_Simpson.png'
        },
        {
            name: 'Bart',
            surname: 'Simpson',
            age: 10,
            info: 'Бартолом\'ю ДжоДжо «Барт» Сімпсон (англ. Bartholomew JoJo «Bart» Simpson) — один із головних героїв мультиплікаційного серіалу Сімпсони. Барт — найстарша дитина Гомера і Мардж Сімпсон. У нього також є дві молодші сестри — Ліса і Меґґі. Барт є втіленням образу бешкетника та посереднього учня у школі. Разом зі своїм батьком Барт є одним із найвідоміших персонажів у цьому серіалі.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/a/aa/Bart_simpson.png'
        },
        {
            name: 'Lisa',
            surname: 'Simpson',
            age: 9,
            info: 'Знання Ліси охоплюють широке коло галузей, від астрономії до медицини, і більше зосереджені на світових справах, ніж на повсякденному житті. Інтелект і особиста успішність Ліси є характерною рисою, притаманною жіночій лінії родини Сімпсонів (див. серію «Ліса з роду Сімпсонів», в якій пояснюється, що ген, присутній в Y-хромосомі Сімпсонів-чоловіків, гальмує їхній інтелектуальний розвиток). Ліса також високо цінує власну моральність, як видно в ситуації, де вона шахрує під час тестування в школі й отримує найвищу оцінку «A+++», проте згодом визнає свою нечесність, зізнається в цьому директорові школи (який, утім, не бажає вірити в це) і ставить сама собі найнижчу оцінку «F». Як і Барт, Ліса неодноразово зазнає покарань у школі, часто внаслідок бунтівної та навіть антисоціальної поведінки, спрямованої проти адміністрації та влади. Прикладом може бути ситуація, в якій дівчинка викрала всі вчительські видання підручників у школі та спричинила паніку серед педколективу через побоювання, що їхнє невігластво буде викрито.\n' +
                '\n' +
                'Хоча бунт Ліси проти соціальних норм зазвичай зображується як конструктивний та героїчний, нерідко він має самоцільний характер. Наприклад, у серії «Барт-зірка» дівчинка урочисто, з викликом оголошує про свій намір вступити до футбольної команди, наголошуючи на своїй статі. Дізнавшись, що в команді вже є дівчатка, Ліса висловлює протест проти використання м\'яча зі свинячої шкіри. Коли ж їй повідомляють, що м\'яч насправді є синтетичним, їй бракує слів, і вона тікає геть, засмучена.',
            photo: 'https://upload.wikimedia.org/wikipedia/ru/e/ec/Lisa_Simpson.png'
        },
        {
            name: 'Maggie',
            surname: 'Simpson',
            age: 1,
            info: 'Ма́ргарет Эвелин «Мэ́гги» Си́мпсон (англ. Margaret Evelyn “Maggie” Simpson) — персонаж мультсериала «Симпсоны». Впервые появилась на телевидении в шоу Трейси Ульман, в короткометражке Good Night (англ.)русск. 19 апреля 1987 года. Мэгги была придумана и разработана карикатуристом Мэттом Грейнингом, пока он ждал встречи с Джеймсом Л. Бруксом. Названа в честь младшей сестры Грейнинга. После появления в шоу Трейси Ульман, через три года семья Симпсонов получила собственный сериал на телеканале Fox, дебют произошёл 17 декабря 1989 года.',
            photo: 'https://upload.wikimedia.org/wikipedia/ru/9/9d/Maggie_Simpson.png'
        },
        {
            name: 'Barney',
            surname: 'Gumble',
            age: 38,
            info: 'Barnard «Barney» Gumble; нар. 20 квітня)[3] — персонаж мультсеріалу Сімпсони, який, за власним визнанням, є невиліковним алкоголіком. Барні є однолітком та колишнім шкільним другом Гомера Сімпсона. Чоловікам по 38 років, але Гамбл є старшим за Гомера, який народився у травні. Через свій алкоголізм Барні поки неодружений; у нього немає подруг. Незважаючи на це, чоловік завжди вірний своїм друзям. Барні неодноразово рятував Гомера з сім\'єю з різних небезпечних пригод.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/2/25/Barney_110.gif'
        },
        {
            name: 'Маленький Помічник Санти',
            surname: 'dog',
            age: 3,
            info: 'Пес з\'являється в родині Сімпсонів в першій серії мультсеріалу. Історія його появи така: Гомер не отримав різдвяної премії, тому не має за що купити подарунки родині. Аби заробити хоч щось, він влаштовується працювати Санта-Клаусом. В результаті отримує лише 13 доларів. Його друг Барі радить поставити ці гроші на пса, який бере участь у собачих бігах і вважається фаворитом. Та Гомер не слухається і ставить все на іншу собаку — Помічника Санти, бо йому подобається прізвисько пса. Але той прибігає на фініш останнім. Розлючений власник викидає пса на вулицю. Гомер вирішує забрати його додому. Це стає найкращим подарунком для родини на Різдво.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/8/81/%D0%9C%D0%9F%D0%A1.gif'
        },
        {
            name: 'Marion Anthony',
            surname: 'D\'Amico',
            age: 46,
            info: 'Жирний Тоні контролює цілу гілку свого кримінального угрупування, у якому понад 200 бандитів, проте у серіалі фігурують тільки декілька наближених до Тоні осіб: Ноги, Луї, Джоні, Джой, Джої (що у перекладі означає «дитинча кенгуру») та «стукач» Френкі.\n' +
                '\n' + 'Жирний Тоні помер від серцевого нападу у 9-й серії 22-го сезону («Donnie Fatso») і був замінений своїм кузеном Струнким Тоні. Згодом той розжирів і його так само стали називати Жирний Тоні.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/6/68/The_Simpsons-Fat_Tony-1-.png'
        },
        {
            name: 'Robert Underdunk',
            surname: 'Terwilliger',
            age: 45,
            info: 'Спочатку грав у серіалі невелику роль — був актором другого плану у шоу клоуна Красті, надалі перетворився на лиходія, одержимого ідеєю вбивства Барта Сімпсона, хоча насправді він не може вбити хлопчика. Примітні особливості Боба: неслухняне яскраве волосся, ступні величезного розміру і приголомшливий голос',
            photo: 'https://static.wikia.nocookie.net/simpsons/images/0/0a/Robert_Terwilliger_Tapped_Out.png'
        },
        {
            name: 'Ганс',
            surname: 'Мельман',
            age: 31,
            info: 'Ганс Молеман дуже старий на вигляд (йому не менш 70-80 років): низький худорлявий чоловік, носить великі округлі окуляри, які у 8-10 разів більші ніж очі — бачить дуже погано. Проте у серії «Успіхи щасливого шлюбу» виявляється, що йому усього 31 рік — неймовірно, але пояснюється це тим, що замолоду зловживав алкоголем, курив марихуану, сигарети, приймав наркотики, споживав фаст-фуд, через що став карликом, має хворобу Паркінсона, його тіло напівспаралізоване, він майже повністю облисів, надзвичайно погано бачить і чує, у нього проблеми з нирками і, можливо, хвороба Альцгеймера. У Ганса жахливі проблеми зі здоров\'ям і він постійно на все скаржиться, його песимізм часто відбивається на здоров\'ї. У багатьох епізодах він виглядає безнадійно хворим, усі говорять, що більше півроку він не протягне.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/c/ca/Hanz.gif'
        },
        {
            name: 'Kang and Kodos',
            surname: 'іншопланетяни',
            age: 0,
            info: 'Канг і Кодос — іншопланетяни з планети Рігель-7. Вони досить сильно відрізняються за анатомічною будовою від людей. По-перше, вони мають зелену шкіру. Їхня шкіра є так само чутлива до будь-яких подразників. По-друге, вони сильно відрізняються за зовнішністю — мають лише одне око, довгу високу голову і замість ніг мають щупальця. У них усього вісім щупалець, але зазвичай при огляді персонажа або стоп-кадрі — видно лише шість. Їхня дихальна система, мабуть, відрізняється від людської — вони закривають голови шоломами. Можливо — земне повітря несприятливе для них. Їхній зріст — 190 см за даними з коміксів і 220 см за розміткою з мультфільму. Що знаходиться під їхнім тілом — невідомо. Як вони розмножуються — загадка, проте очевидно — не статевим шляхом. В усякому випадку ні яким земним. Зі слів Канга (а він представник раси рігеліанців) — для запліднення вони використовують лише лазерний маніпулятор. Також відносно невідома їхня стать. За даними з коміксів і мультфільму, Канг — це чоловік, а Кодос — жінка. Проте невідомо, як їх розрізняти за статтю — вони абсолютно однакові.',
            photo: 'https://upload.wikimedia.org/wikipedia/uk/d/d8/Kangandkodos.jpg'
        }
    ];

    return (
        <div>
            {simpsons.map((simpson, index)=><Simpson key={index} simpson={simpson}/>)}
        </div>
    );
};

export {Simpsons};